# Напишите программу, которая будет преобразовывать десятичное число в двоичное.

# Пример:

# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10

bin_n = []
n = int(input())
while n >= 2:
    bin_n.append(str(n % 2))
    n //= 2
bin_n.append(str(n))
print(''.join(bin_n[::-1]))
